---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyUInt64
source: html/6a1ec5c5-8797-0124-e955-998a1b8cd669.htm
---
# AssetPropertyUInt64 Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.